#+TITLE: MongoDB
#+AUTHOR: Prof. Miguel Angel Escalante Serrato
#+EMAIL:  miguel.escalante@itam.mx
#+DATE: 8 Sep 2022
#+STARTUP: showall


* Contenedor de Docker
#+begin_src shell
  docker stop mongo
  docker rm mongo
  export DATA_DIR=`pwd`/data
  echo $DATA_DIR
  export EX_DIR=`pwd`/mongodb-sample-dataset
  echo $EX_DIR
  mkdir -p $DATA_DIR
  docker run -p 27017:27017 \
         -v $DATA_DIR:/data/db \
         -v $EX_DIR:/mongodb-sample-dataset \
         --name mongo \
         -d mongo
  export DHC=$(docker ps -aqf "name=mongo")
  sleep 2
  docker exec -it $DHC mongosh
#+end_src

#+RESULTS:

#+begin_src sh
  export DATA_DIR=`pwd`/data
  echo $DATA_DIR
  mkdir -p $DATA_DIR
  docker run -p 27017:27017 \
         -v $DATA_DIR:/data/db \
         --name mongo \
         -d mongo
#+end_src

#+RESULTS:


#+begin_src shell
  docker stop mongo
  docker rm mongo
#+end_src

#+RESULTS:
| mongo |
| mongo |

#+NAME: container
#+BEGIN_SRC sh
  docker ps -aqf "name=mongo"
#+END_SRC

#+RESULTS: container
: 840015a6853d

#+RESULTS:

#+begin_src shell :var DHC=container
  export DHC=$DHC
  export DHC=$(docker ps -aqf "name=mongo")
#+end_src

#+RESULTS:

#+begin_src shell :var DHC=container
  docker exec -it $DHC mongosh
#+end_src

